app/Http/Controllers/API/V1/ActionTrackerController.php

select * from `action_trackers` where year(`created_at`) = '2024' and `action_trackers`.`deleted_at` is null
select * from `agendas` where `agendas`.`meeting_id` in (18, 19)
select * from `businesses` where `businesses`.`id` in (1)
select * from `meetings` where `meetings`.`id` in (18, 19)
---
    public function getListOfActionTrackers(Request $request)
    {
        try{
            \Log::info("coming requist actions trackers");
            $currentYear = Carbon::now()->format('Y');
            $year = $request->dateYearRequest ?? $currentYear;
            \Log::info($year);
            $actionstrackers = ActionTracker::with([
                                                    'business',
                                                    'meeting' => function($q){
                                                        $q->with('agendas');
                                                    },
                                                    'details' => function($q){
                                                        return $q->with('agenda');
                                                    },
                                                    'member'=> function($e){
                                                        return $e->with('position');
                                                    }
                                                    ]
                                )
                                ->whereYear('created_at', $year)->get();

select * from `action_trackers` where `business_id` = '1' and `action_status` LIKE '%DELAYED%' and `action_trackers`.`deleted_at` is null
select * from `agendas` where `agendas`.`meeting_id` in (19)
select * from `businesses` where `businesses`.`id` in (1)
select * from `meetings` where `meetings`.`id` in (19)
select * from `members` where `members`.`id` in (1) and `members`.`deleted_at` is null
---
    public function getListOfActionTrackersWhereLike(Request $request)
    {
        try{
        $actionstrackers = ActionTracker::where('business_id', $request->business_id)
                            ->with([
                                'member' => function ($e) use ($request) {
                                    $e->with([
                                        'position' => function ($query) use ($request) {
                                            $query->where('position_name', 'LIKE', '%' . $request->position_name . '%');
                                        }
                                    ]);
                                },
                                'business',
                                'meeting'=> function($q){
                                     $q->with('agendas');
                                },
                                'details' => function ($q) {
                                    $q->with('agenda');
                                }
                            ])
                            ->when(
                                $request->action_status, function ($query) use ($request){
                                    $query->where('action_status', 'LIKE', '%' . $request->action_status . '%');
                                }
                                )
                            ->when(
                                $request->position_name, function ($query) use ($request){
                                    $query-> whereHas('member.position', function ($query) use ($request) {
                                        $query->where('position_name', 'LIKE', '%' . $request->position_name . '%');
                                    });
                                }
                            )
                            ->get();

select * from `action_trackers` where `action_trackers`.`id` = '3' and `action_trackers`.`deleted_at` is null limit 1
---
    public function editActionsTracker(Request $request)
    {
        try{
                $validator = Validator::make($request->all(), [
                    'date_due'    => 'required|string',
                    'member_id'   => 'required|integer',
                    'action_id'   => 'required|integer',
                    'business_id' => 'required|integer',
                ]);

                if ($validator->fails()) {
                    return  $this->error('', $validator->errors(), 401);
                }
                $data = array();
                $action = ActionTracker::findOrFail($request->action_id);

insert into `notifications` (`notification_title`, `notification_body`, `notification_token`, `member_id`, `user_id`, `action_id`, `business_id`, `updated_at`, `created_at`) values ('ssss', '2024-03-17 12:00:00', 'd_knToKITVqH5CBPtuH0N4:APA91bEPDU1ouSjDlcqgF2JhZ56G1UhcsB6HQ-aBeAMccNQvyQ9NoYgh7wYiSBtiSqwJyOnbDWxXwTSdBVk48ftiW2H5FbDc6_fUjKlewtesRM9_EWfa-c_A7rZzEZOQwfMpjqmegEpc', '1', 1, 3, '1', '2024-03-16 21:37:40', '2024-03-16 21:37:40')
select * from `agendas` where `agendas`.`id` in (18)
select * from `businesses` where `businesses`.`id` in (1)
select * from `meetings` where `meetings`.`id` in (19)
select * from `members` where `members`.`id` in (1) and `members`.`deleted_at` is null
---
                $data['body'] = $action->date_due;
                $data['title'] = $action->tasks;
                $this->firebaseNotificationService->sendFirebaseNotification($data);
                Notification::create([
                    'notification_title' => $action->tasks,
                    'notification_body' => $action->date_due,
                    'notification_token' => $data['token'],
                    'member_id' => $request->member_id,
                    'user_id' => 1,
                    'action_id' => $action->id,
                    'business_id' => $request->business_id
                ]);
                // \Log::info("action inserted done");
                $action = $action->load(['business','meeting','details' => function($q){ return $q->with('agenda');},'member'=> function($e){return $e->with('position');}]);