app/Http/Controllers/API/V1/BoardController.php

    public function getListOfBoards(Request $request)
    {
        \Log::info($request->business_id);
        $boards = Board::where('business_id', $request->business_id)->with(['business','members' => function($e){return $e->with('position');}])->get();
---
select * from `boards` where `business_id` = '1' and `boards`.`deleted_at` is null
select * from `businesses` where `businesses`.`id` in (1)
select `members`.*, `board_member`.`board_id` as `pivot_board_id`, `board_member`.`member_id` as `pivot_member_id`, `board_member`.`created_at` as `pivot_created_at`, `board_member`.`updated_at` as `pivot_updated_at` from `members` inner join `board_member` on `members`.`id` = `board_member`.`member_id` where `board_member`.`board_id` in (1) and `members`.`deleted_at` is null