app/Http/Controllers/API/V1/CommitteeController.php

    public function getListOfCommittees(Request $request)
    {
        \Log::info($request->business_id);
        //should say where business and where board
        $committees = Committee::where('business_id', $request->business_id)
                                ->with([
                                    'meetings',
                                    'board' => function($e){
                                        return $e->with('business');
                                    },
                                    'business',
                                    'members' => function($e){
                                        return $e->with('position');
                                    }
                                    ])->get();
---
select * from `boards` where `boards`.`id` in (1) and `boards`.`deleted_at` is null
select * from `businesses` where `businesses`.`id` in (1)
select * from `committees` where `business_id` = '1'
select * from `meetings` where `meetings`.`committee_id` in (1)