app/Http/Controllers/API/V1/MeetingController.php

select * from `meetings` where `business_id` = '1'
---
    public function getListOfMeetings(Request $request)
    {
        \Log::info("coming Request Meetings");
        // $meetings = Meeting::where('meeting_status',MeetingStatusEnum::QOURMREACHED)->get();
        // $meetings = Meeting::where('meeting_status',MeetingStatusEnum::SIGNED)->get();
        // $meetings = Meeting::where('meeting_status',MeetingStatusEnum::NOTSIGNED)->get();
        // $meetings = Meeting::where('meeting_status',MeetingStatusEnum::PARTIAL)->get();
        $meetings = Meeting::where('business_id',$request->business_id)->get();

select * from `agendas` where `agendas`.`meeting_id` = 34 and `agendas`.`meeting_id` is not null
select * from `meetings` where `meetings`.`id` = '34' limit 1
---
    public function getListOfAgendaByMeetingId(Request $request)
    {
        \Log::info($request->meeting_id);
        $agendas = Meeting::findOrFail($request->meeting_id)->agendas()->get();

insert into `agendas` (`agenda_title`, `agenda_description`, `agenda_time`, `agenda_presenter`, `agenda_file`, `file_name`, `file_full_path`, `created_by`, `updated_at`, `created_at`) values ('Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a ty', 'Lorem Ipsum is simply dummy text of the printing and typesetting ind', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', '1710700916.tapo.pdf', 'tapo.pdf', 'meetings/boards/1710700916.tapo.pdf', 1, '2024-03-17 18:41:56', '2024-03-17 18:41:56')
update `agendas` set `meeting_id` = 34, `agendas`.`updated_at` = '2024-03-17 18:41:56' where `id` = 34
---
                        $path = Storage::disk('meetings_uploads')->put($filePathDir.'/'. $fileName, $fileSelf);
                        $fileFullPath = 'meetings/'.$filePathDir.'/'.$fileName;
                        \Log::info($fileFullPath);
                        $agendas[] = Agenda::create([
                                        "agenda_title" => $request->listOfAgendas[$i]['agenda_title'],
                                        "agenda_description" => $request->listOfAgendas[$i]['agenda_description'],
                                        "agenda_time" => $request->listOfAgendas[$i]['agenda_time'],
                                        'agenda_presenter' => $request->listOfAgendas[$i]['presenter_id'],
                                        "agenda_file" => $fileName,
                                        "file_name" => $file,
                                        "file_full_path" => $fileFullPath,
                                        "created_by" => $request->listOfAgendas[$i]['created_by'],
                                    ]);

                    }
                    $meeting->agendas()->saveMany($agendas);