app/Http/Controllers/API/V1/MemberController.php

select * from `members` where `business_id` = '1' and `members`.`deleted_at` is null
select * from `positions` where `positions`.`id` in (1)
select `boards`.*, `board_member`.`member_id` as `pivot_member_id`, `board_member`.`board_id` as `pivot_board_id`, `board_member`.`created_at` as `pivot_created_at`, `board_member`.`updated_at` as `pivot_updated_at` from `boards` inner join `board_member` on `boards`.`id` = `board_member`.`board_id` where `board_member`.`member_id` in (1) and `boards`.`deleted_at` is null
select `committees`.*, `committee_member`.`member_id` as `pivot_member_id`, `committee_member`.`committee_id` as `pivot_committee_id`, `committee_member`.`created_at` as `pivot_created_at`, `committee_member`.`updated_at` as `pivot_updated_at` from `committees` inner join `committee_member` on `committees`.`id` = `committee_member`.`committee_id` where `committee_member`.`member_id` in (1)
---
    public function getListOfMember(Request $request)
    {
        \Log::info($request->business_id);
        $members = Member::where('business_id', $request->business_id)->with(['position','committees' => function($q){
            return $q->with(['business','board'=> function($q){return $q->with(['business']);}]);
        },'boards'=> function($e){return $e->with('business');},
        'criterias' => function($q){ return $q->with(['business','user']);}
        ])->get();