app/Http/Controllers/API/V1/MinutesController.php

select * from `agenda_details` where `agenda_details`.`agenda_id` in (18, 20, 26, 28, 34)
select * from `agendas` where `agendas`.`meeting_id` in (18, 34)
select * from `attendance_board` where `attendance_board`.`minute_id` in (1, 2, 3)
select * from `boards` where `boards`.`id` in (1) and `boards`.`deleted_at` is null
---
    public function getListOfMinutes(Request $request)
    {
        // \Log::info("coming requist minutes");
        $currentYear = Carbon::now()->format('Y');
        $year = $request->dateYearRequest ?? $currentYear;
        // \Log::info($year);
        $minutes = Minutes::where('business_id',$request->business_id)->with(['business','user','attendance_boards',
            'meeting'=> function($q){ return $q->with(['agendas'=>function($q){ return $q->with(['agenda_details'=> function($q){return $q->with('agenda');}]);},
                                    'committee'=> function($q){
                                    return $q->with([
                                    'board' => function($q){ return $q->with('business');},
                                    'members' => function($e){return $e->with('position');}
                                ]);},
                                'board'=> function($q){ return $q->with('business');}]);},
            'committee'=> function($q){
                return $q->with([
                                    'board' => function($q){ return $q->with('business');},
                                    'members' => function($e){return $e->with('position');}
                                ]);},
            'board' => function($q){ return $q->with(['business','members' => function($e){return $e->with(['position',
            'minute_signature'=> function($e){return $e->with(['member' => function($e){return $e->with(['position','minute_signature'=> function($e){return $e->with(['member' => function($q){return $q->with('position');}]);}]);}]);},
            'signature_member'=> function($e){return $e->with(['member' => function($e){return $e->with(['position','minute_signature']);}]);},]);}]);}
            ])->where(function($q) use($year){
                $q->where(DB::raw('YEAR(created_at)'), $year)->orWhere(DB::raw('YEAR(created_at)'), Carbon::now()->format('Y'));
            })->get();

select * from `boards` where `boards`.`id` in (1) and `boards`.`deleted_at` is null
select * from `meetings` where `meetings`.`id` = '34' limit 1
---
    public function inserNewMinute(Request $request)
    {
        //  \Log::info($request->all());
        try{
                $validator = Validator::make($request->all(), [
                    // 'minute_name' => 'required|string',
                    // 'minute_date' => 'required|string',
                    'meeting_id' => 'required',
                    // 'minute_decision' => 'required',
                    'business_id' => 'required',
                    'add_by' => 'required',
                    // 'board_id' => 'required',
                ]);

                if ($validator->fails()) {
                    return  $this->error('', $validator->errors(), 401);
                }

                $meeting = Meeting::findOrFail($request->meeting_id)->load('board');

insert into `minutes` (`minute_name`, `minute_numbers`, `minute_date`, `committee_id`, `minute_decision`, `board_id`, `meeting_id`, `minute_status`, `add_by`, `business_id`, `updated_at`, `created_at`) values ('meeting test', '34-2024', '2024-03-26 08:38:00', '', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum', 1, '34', 'NOTSIGNED', 1, 1, '2024-03-17 18:43:22', '2024-03-17 18:43:22')
---
                $meeting_description = $meeting->meeting_description;
                $minute_name = $meeting->meeting_title;

                $minute = Minutes::create([
                        "minute_name" => $minute_name,
                        'minute_numbers' => $genarate_numbers,
                        'minute_date' => $date,
                        "committee_id" => $request->committee_id ?? null,
                        "minute_decision" => $request->minute_decision ?? $meeting_description,
                        "board_id" => $meeting->board->id ?? null,
                        "meeting_id" => $request->meeting_id ?? null,
                        "minute_status" => $request->minute_status ?? "NOTSIGNED",
                        "add_by" => $request->add_by,
                        "business_id" => $request->business_id,
                    ]);

insert into `agenda_details` (`agenda_id`, `missions`, `tasks`, `reservations`, `updated_at`, `created_at`) values (34, 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', '2024-03-17 18:43:22', '2024-03-17 18:43:22')
select * from `agenda_details` where (`agenda_id` = 34) limit 1
insert into `action_trackers` (`tasks`, `date_assigned`, `meeting_id`, `agenda_detail_id`, `updated_at`, `created_at`) values ('Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s', '2024-03-17 18:43:22', '34', 3, '2024-03-17 18:43:22', '2024-03-17 18:43:22')
---
                if($request->listOfAgendaDetails && is_array($request->listOfAgendaDetails) && count($request->listOfAgendaDetails) > 0){

                    for($i = 0; $i < count($request->listOfAgendaDetails); $i++){
                        $details = AgendaDetails::updateOrCreate(
                                       ['agenda_id' => $request->listOfAgendaDetails[$i]['agenda_id'] ],
                                        [
                                        "missions" => $request->listOfAgendaDetails[$i]['missions'] ,
                                        "tasks" => $request->listOfAgendaDetails[$i]['tasks'] ,
                                        "reservations" => $request->listOfAgendaDetails[$i]['reservations']
                                        ]
                                    );
                        $actions = ActionTracker::create([
                                        'tasks' => $request->listOfAgendaDetails[$i]['tasks'],
                                        'date_assigned' => now(),
                                        'meeting_id' => $request->meeting_id ?? null,
                                        'agenda_detail_id' => $details->id,
                                        ]);

insert into `attendance_board` (`attended_name`, `position`, `minute_id`, `updated_at`, `created_at`) values ('', '', 2, '2024-03-17 18:43:22', '2024-03-17 18:43:22')
---

                if($request->attendance && is_array($request->attendance) && count($request->attendance) > 0){
                    for($i = 0; $i < count($request->attendance); $i++){
                        $minute->attendance_boards()->create([
                                                         'attended_name' => $request->attendance[$i]['attended_name'],
                                                         'position' => $request->attendance[$i]['position'],
                                                     ]);

select * from `attendance_board` where `attendance_board`.`minute_id` in (2)
select * from `meetings` where `meetings`.`id` in (34)
select * from `users` where `users`.`id` in (1) and `users`.`deleted_at` is null
---
                }

                // \Log::info("minute inserted done");
            return $this->success([
                'minute' => $minute->load('meeting','user','attendance_boards'),
            ]);