app/Http/Controllers/API/V1/NotesController.php

select * from `boards` where exists (select * from `meetings` where `boards`.`id` = `meetings`.`board_id` and exists (select * from `agendas` where `meetings`.`id` = `agendas`.`meeting_id`)) and year(`created_at`) = '2024' and `boards`.`deleted_at` is null
select * from `businesses` where `businesses`.`id` in (1)
select * from `meetings` where `meetings`.`board_id` in (1) and exists (select * from `agendas` where `meetings`.`id` = `agendas`.`meeting_id`)
select `members`.*, `board_member`.`board_id` as `pivot_board_id`, `board_member`.`member_id` as `pivot_member_id`, `board_member`.`created_at` as `pivot_created_at`, `board_member`.`updated_at` as `pivot_updated_at` from `members` inner join `board_member` on `members`.`id` = `board_member`.`member_id` where `board_member`.`board_id` in (1) and `members`.`deleted_at` is null
select * from `agendas` where `agendas`.`meeting_id` in (18, 20, 21, 34)
---
    public function getListOfBoardNotes(Request $request)
    {
        try{
            \Log::info("comeing request notes");
            $currentYear = Carbon::now()->format('Y');
            $year = $request->dateYearRequest ?? $currentYear;
            \Log::info($year);
            $boards =  Board::with([
                                    'meetings' => function ($q) {
                                            $q->with('agendas')
                                            ->whereHas('agendas');
                                    },
                                    'business',
                                    'members' => function($e){
                                        return $e->with('position');
                                    }
                                    ]

                                    ) ->whereHas('meetings.agendas')
                            ->whereYear('created_at', $year)
                        ->get();

select * from `businesses` where `businesses`.`id` in (1)
select * from `committees` where exists (select * from `meetings` where `committees`.`id` = `meetings`.`committee_id` and exists (select * from `agendas` where `meetings`.`id` = `agendas`.`meeting_id`)) and year(`created_at`) = '2024'
select * from `meetings` where `meetings`.`committee_id` in (1) and exists (select * from `agendas` where `meetings`.`id` = `agendas`.`meeting_id`)
select `members`.*, `committee_member`.`committee_id` as `pivot_committee_id`, `committee_member`.`member_id` as `pivot_member_id`, `committee_member`.`created_at` as `pivot_created_at`, `committee_member`.`updated_at` as `pivot_updated_at` from `members` inner join `committee_member` on `members`.`id` = `committee_member`.`member_id` where `committee_member`.`committee_id` in (1) and `members`.`deleted_at` is null
select * from `agendas` where `agendas`.`meeting_id` in (19)
---
    public function getListOfCommitteeNotes(Request $request)
    {
        try{
            \Log::info("comeing request notes");
            $currentYear = Carbon::now()->format('Y');
            $year = $request->dateYearRequest ?? $currentYear;
            \Log::info($year);
            $committees =  Committee::with([
                                    'meetings' => function ($q) {
                                            $q->with('agendas')
                                            ->whereHas('agendas');
                                    },
                                    'business',
                                    'members' => function($e){
                                        return $e->with('position');
                                    }
                                    ]

                                    ) ->whereHas('meetings.agendas')
                            ->whereYear('created_at', $year)
                        ->get();