app/Http/Controllers/API/V1/NotificationController.php

    public function getListOfNotification(Request $request)
    {
        try{
            \Log::info("comeing request notes");
            $currentYear = Carbon::now()->format('Y');
            $year = $request->dateYearRequest ?? $currentYear;
            \Log::info($year);
            $notifications =  Notification::get();
---
select * from `notifications`