app/Models/Meeting.php

select * from `meetings` where `business_id` = 1 and year(`created_at`) = 2024 order by `meeting_serial_number` desc limit 1
---
    protected static function boot()
    {
        parent::boot();
        static::creating(function ($meeting) {
            $currentYear = now()->year;
            $business_id = $meeting->business_id;
            // Find the last meeting in the current year for this business
            $lastMeetingOfYear = Meeting::where('business_id', $business_id)
                                        ->whereYear('created_at', $currentYear)
                                        ->orderBy('meeting_serial_number', 'desc')
                                        ->first();